; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-10-8)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 - object)
(:init
(at-robby robot1 room4)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room5)
(at ball2 room10)
(at ball3 room7)
(at ball4 room2)
(at ball5 room3)
(at ball6 room10)
(at ball7 room10)
(at ball8 room8)
)
(:goal
(and
(at ball1 room10)
(at ball2 room3)
(at ball3 room4)
(at ball4 room9)
(at ball5 room3)
(at ball6 room5)
(at ball7 room7)
(at ball8 room2)
)
)
)

; plan
1. (move robot1 room4 room8)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room8)
   goals met: 1 of 8
2. (pick robot1 ball8 room8 lgripper1)
   deleted: (at ball8 room8) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 1 of 8
3. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 1 of 8
4. (move robot1 room9 room2)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room2)
   goals met: 1 of 8
5. (drop robot1 ball8 room2 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room2) (free robot1 lgripper1)
   goals met: 2 of 8
6. (pick robot1 ball4 room2 rgripper1)
   deleted: (at ball4 room2) (free robot1 rgripper1)
   added: (carry robot1 ball4 rgripper1)
   goals met: 2 of 8
7. (move robot1 room2 room9)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room9)
   goals met: 2 of 8
8. (drop robot1 ball4 room9 rgripper1)
   deleted: (carry robot1 ball4 rgripper1)
   added: (at ball4 room9) (free robot1 rgripper1)
   goals met: 3 of 8
9. (move robot1 room9 room7)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room7)
   goals met: 3 of 8
10. (pick robot1 ball3 room7 lgripper1)
   deleted: (at ball3 room7) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 3 of 8
11. (move robot1 room7 room4)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room4)
   goals met: 3 of 8
12. (drop robot1 ball3 room4 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room4) (free robot1 lgripper1)
   goals met: 4 of 8
13. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 4 of 8
14. (move robot1 room7 room5)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room5)
   goals met: 4 of 8
15. (pick robot1 ball1 room5 lgripper1)
   deleted: (at ball1 room5) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 4 of 8
16. (move robot1 room5 room10)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room10)
   goals met: 4 of 8
17. (drop robot1 ball1 room10 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room10) (free robot1 lgripper1)
   goals met: 5 of 8
18. (pick robot1 ball7 room10 rgripper1)
   deleted: (at ball7 room10) (free robot1 rgripper1)
   added: (carry robot1 ball7 rgripper1)
   goals met: 5 of 8
19. (move robot1 room10 room7)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room7)
   goals met: 5 of 8
20. (drop robot1 ball7 room7 rgripper1)
   deleted: (carry robot1 ball7 rgripper1)
   added: (at ball7 room7) (free robot1 rgripper1)
   goals met: 6 of 8
21. (move robot1 room7 room5)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room5)
   goals met: 6 of 8
22. (move robot1 room5 room10)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room10)
   goals met: 6 of 8
23. (pick robot1 ball6 room10 lgripper1)
   deleted: (at ball6 room10) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 6 of 8
24. (pick robot1 ball2 room10 rgripper1)
   deleted: (at ball2 room10) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 6 of 8
25. (move robot1 room10 room5)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room5)
   goals met: 6 of 8
26. (drop robot1 ball6 room5 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room5) (free robot1 lgripper1)
   goals met: 7 of 8
27. (move robot1 room5 room3)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room3)
   goals met: 7 of 8
28. (drop robot1 ball2 room3 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room3) (free robot1 rgripper1)
   goals met: 8 of 8
